using System;

interface ISetInt
{
    int GetCount();  // отримати кількість елементів множини (можна використати властивість)
    bool Add(int value);  // додати число у множину, якщо такого числа там не було - повернути true, інакше - false
    bool Remove(int value);  // видалити число з множини, якщо такого числа там не було - повернути false, інакше - true
    bool Contains(int value);  // перевірити чи число є у множині, якщо такого числа там нема - повернути false, інакше - true
    void Clear();  // зробити множину порожньою

    void CopyTo(int[] array);  // скопіювати всі числа з множини у масив, що переданий через параметр (порядок запису чисел не важливий). Якщо довжина переданого масиву замала, викидати System.ArgumentException
    bool SetEquals(ISetInt other); // перевіряє чи поточна та інша множини містять однаковий набір елементів.
    void UnionWith(ISetInt other); // модифікує поточну множину так, що вона містить всі елементи з цієї та іншої множини.
}
